{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Lambda", "config": {"name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>O\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32", "output_shape": null, "output_shape_type": "raw", "function_type": "lambda", "arguments": {}, "batch_input_shape": [null, 64, 64, 3], "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "elu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "b_regularizer": null, "bias": true, "subsample": [2, 2], "nb_filter": 3, "W_regularizer": null, "name": "layer1_conv2d", "b_constraint": null, "init": "glorot_uniform", "activation": "linear", "nb_row": 5, "W_constraint": null, "nb_col": 5}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "elu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "b_regularizer": null, "bias": true, "subsample": [2, 2], "nb_filter": 24, "W_regularizer": null, "name": "layer2_conv2d", "b_constraint": null, "init": "glorot_uniform", "activation": "linear", "nb_row": 5, "W_constraint": null, "nb_col": 5}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "elu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "b_regularizer": null, "bias": true, "subsample": [1, 1], "nb_filter": 36, "W_regularizer": null, "name": "layer3_conv2d", "b_constraint": null, "init": "glorot_uniform", "activation": "linear", "nb_row": 5, "W_constraint": null, "nb_col": 5}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "elu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "b_regularizer": null, "bias": true, "subsample": [1, 1], "nb_filter": 48, "W_regularizer": null, "name": "layer4_conv2d", "b_constraint": null, "init": "glorot_uniform", "activation": "linear", "nb_row": 3, "W_constraint": null, "nb_col": 3}}, {"class_name": "Activation", "config": {"name": "activation_5", "activation": "elu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "b_regularizer": null, "bias": true, "subsample": [1, 1], "nb_filter": 64, "W_regularizer": null, "name": "layer5_conv2d", "b_constraint": null, "init": "glorot_uniform", "activation": "linear", "nb_row": 3, "W_constraint": null, "nb_col": 3}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "Activation", "config": {"name": "activation_6", "activation": "elu", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_7", "activation": "elu", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "output_dim": 100, "bias": true, "input_dim": 1600, "W_regularizer": null, "name": "dense_1", "b_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "activation": "linear", "trainable": true, "W_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.5}}, {"class_name": "Activation", "config": {"name": "activation_8", "activation": "elu", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "output_dim": 50, "bias": true, "input_dim": 100, "W_regularizer": null, "name": "dense_2", "b_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "activation": "linear", "trainable": true, "W_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_9", "activation": "elu", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "output_dim": 10, "bias": true, "input_dim": 50, "W_regularizer": null, "name": "dense_3", "b_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "activation": "linear", "trainable": true, "W_constraint": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "output_dim": 1, "bias": true, "input_dim": 10, "W_regularizer": null, "name": "dense_4", "b_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "activation": "linear", "trainable": true, "W_constraint": null}}]}