{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "batch_input_shape": [null, 64, 64, 3], "input_dtype": "float32", "output_shape": null, "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>^\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "output_shape_type": "raw"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "W_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.009999999776482582}, "name": "convolution2d_1", "activation": "elu", "nb_filter": 24, "b_constraint": null, "nb_col": 5, "nb_row": 5, "b_regularizer": null, "subsample": [2, 2], "border_mode": "valid", "activity_regularizer": null, "bias": true, "dim_ordering": "tf", "init": "glorot_uniform"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "W_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.009999999776482582}, "name": "convolution2d_2", "activation": "elu", "nb_filter": 36, "b_constraint": null, "nb_col": 5, "nb_row": 5, "b_regularizer": null, "subsample": [2, 2], "border_mode": "valid", "activity_regularizer": null, "bias": true, "dim_ordering": "tf", "init": "glorot_uniform"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "W_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.009999999776482582}, "name": "convolution2d_3", "activation": "elu", "nb_filter": 48, "b_constraint": null, "nb_col": 5, "nb_row": 5, "b_regularizer": null, "subsample": [2, 2], "border_mode": "valid", "activity_regularizer": null, "bias": true, "dim_ordering": "tf", "init": "glorot_uniform"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "W_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.009999999776482582}, "name": "convolution2d_4", "activation": "elu", "nb_filter": 64, "b_constraint": null, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "subsample": [1, 1], "border_mode": "valid", "activity_regularizer": null, "bias": true, "dim_ordering": "tf", "init": "glorot_uniform"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "W_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.009999999776482582}, "name": "convolution2d_5", "activation": "elu", "nb_filter": 64, "b_constraint": null, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "subsample": [1, 1], "border_mode": "valid", "activity_regularizer": null, "bias": true, "dim_ordering": "tf", "init": "glorot_uniform"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "output_dim": 1164, "name": "dense_1", "activity_regularizer": null, "b_constraint": null, "input_dim": 64, "W_constraint": null, "b_regularizer": null, "activation": "relu", "W_regularizer": null, "init": "glorot_uniform", "bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "output_dim": 100, "name": "dense_2", "activity_regularizer": null, "b_constraint": null, "input_dim": 1164, "W_constraint": null, "b_regularizer": null, "activation": "relu", "W_regularizer": null, "init": "glorot_uniform", "bias": true}}, {"class_name": "Dense", "config": {"trainable": true, "output_dim": 50, "name": "dense_3", "activity_regularizer": null, "b_constraint": null, "input_dim": 100, "W_constraint": null, "b_regularizer": null, "activation": "relu", "W_regularizer": null, "init": "glorot_uniform", "bias": true}}, {"class_name": "Dense", "config": {"trainable": true, "output_dim": 10, "name": "dense_4", "activity_regularizer": null, "b_constraint": null, "input_dim": 50, "W_constraint": null, "b_regularizer": null, "activation": "relu", "W_regularizer": null, "init": "glorot_uniform", "bias": true}}, {"class_name": "Dense", "config": {"trainable": true, "output_dim": 1, "name": "dense_5", "activity_regularizer": null, "b_constraint": null, "input_dim": 10, "W_constraint": null, "b_regularizer": null, "activation": "tanh", "W_regularizer": null, "init": "glorot_uniform", "bias": true}}]}