{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"function_type": "lambda", "batch_input_shape": [null, 64, 64, 3], "input_dtype": "float32", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>@\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1", "output_shape": null, "output_shape_type": "raw", "arguments": {}}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "border_mode": "valid", "subsample": [2, 2], "activation": "linear", "init": "glorot_uniform", "trainable": true, "nb_row": 5, "nb_filter": 3, "dim_ordering": "tf", "W_constraint": null, "b_regularizer": null, "name": "layer1_conv2d", "b_constraint": null, "nb_col": 5, "W_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_2", "trainable": true}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "border_mode": "valid", "subsample": [2, 2], "activation": "linear", "init": "glorot_uniform", "trainable": true, "nb_row": 5, "nb_filter": 24, "dim_ordering": "tf", "W_constraint": null, "b_regularizer": null, "name": "layer2_conv2d", "b_constraint": null, "nb_col": 5, "W_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_3", "trainable": true}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "border_mode": "valid", "subsample": [1, 1], "activation": "linear", "init": "glorot_uniform", "trainable": true, "nb_row": 5, "nb_filter": 36, "dim_ordering": "tf", "W_constraint": null, "b_regularizer": null, "name": "layer3_conv2d", "b_constraint": null, "nb_col": 5, "W_regularizer": null, "bias": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_1", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_4", "trainable": true}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "border_mode": "valid", "subsample": [1, 1], "activation": "linear", "init": "glorot_uniform", "trainable": true, "nb_row": 3, "nb_filter": 48, "dim_ordering": "tf", "W_constraint": null, "b_regularizer": null, "name": "layer4_conv2d", "b_constraint": null, "nb_col": 3, "W_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_5", "trainable": true}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "border_mode": "valid", "subsample": [1, 1], "activation": "linear", "init": "glorot_uniform", "trainable": true, "nb_row": 3, "nb_filter": 64, "dim_ordering": "tf", "W_constraint": null, "b_regularizer": null, "name": "layer5_conv2d", "b_constraint": null, "nb_col": 3, "W_regularizer": null, "bias": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_2", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_6", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_7", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "b_constraint": null, "activation": "linear", "output_dim": 100, "W_constraint": null, "b_regularizer": null, "name": "dense_1", "input_dim": 1600, "W_regularizer": null, "bias": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_3", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_8", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "b_constraint": null, "activation": "linear", "output_dim": 50, "W_constraint": null, "b_regularizer": null, "name": "dense_2", "input_dim": 100, "W_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_9", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "b_constraint": null, "activation": "linear", "output_dim": 10, "W_constraint": null, "b_regularizer": null, "name": "dense_3", "input_dim": 50, "W_regularizer": null, "bias": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "b_constraint": null, "activation": "linear", "output_dim": 1, "W_constraint": null, "b_regularizer": null, "name": "dense_4", "input_dim": 10, "W_regularizer": null, "bias": true}}], "keras_version": "1.2.0"}