{"config": [{"config": {"trainable": true, "output_shape_type": "raw", "batch_input_shape": [null, 64, 64, 3], "arguments": {}, "output_shape": null, "input_dtype": "float32", "function_type": "lambda", "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>K\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}, "class_name": "Lambda"}, {"config": {"trainable": true, "activation": "elu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"b_constraint": null, "bias": true, "nb_row": 5, "nb_filter": 3, "nb_col": 5, "b_regularizer": null, "activity_regularizer": null, "name": "layer1_conv2d", "W_constraint": null, "W_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "trainable": true, "init": "glorot_uniform", "activation": "linear", "subsample": [2, 2]}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "elu", "name": "activation_2"}, "class_name": "Activation"}, {"config": {"b_constraint": null, "bias": true, "nb_row": 5, "nb_filter": 24, "nb_col": 5, "b_regularizer": null, "activity_regularizer": null, "name": "layer2_conv2d", "W_constraint": null, "W_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "trainable": true, "init": "glorot_uniform", "activation": "linear", "subsample": [2, 2]}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "elu", "name": "activation_3"}, "class_name": "Activation"}, {"config": {"b_constraint": null, "bias": true, "nb_row": 5, "nb_filter": 36, "nb_col": 5, "b_regularizer": null, "activity_regularizer": null, "name": "layer3_conv2d", "W_constraint": null, "W_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "trainable": true, "init": "glorot_uniform", "activation": "linear", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "activation": "elu", "name": "activation_4"}, "class_name": "Activation"}, {"config": {"b_constraint": null, "bias": true, "nb_row": 3, "nb_filter": 48, "nb_col": 3, "b_regularizer": null, "activity_regularizer": null, "name": "layer4_conv2d", "W_constraint": null, "W_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "trainable": true, "init": "glorot_uniform", "activation": "linear", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "elu", "name": "activation_5"}, "class_name": "Activation"}, {"config": {"b_constraint": null, "bias": true, "nb_row": 3, "nb_filter": 64, "nb_col": 3, "b_regularizer": null, "activity_regularizer": null, "name": "layer5_conv2d", "W_constraint": null, "W_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "trainable": true, "init": "glorot_uniform", "activation": "linear", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"trainable": true, "activation": "elu", "name": "activation_6"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "activation": "elu", "name": "activation_7"}, "class_name": "Activation"}, {"config": {"W_constraint": null, "input_dim": 1600, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "name": "dense_1", "bias": true, "W_regularizer": null, "trainable": true, "b_constraint": null, "activation": "linear", "output_dim": 100}, "class_name": "Dense"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"trainable": true, "activation": "elu", "name": "activation_8"}, "class_name": "Activation"}, {"config": {"W_constraint": null, "input_dim": 100, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "name": "dense_2", "bias": true, "W_regularizer": null, "trainable": true, "b_constraint": null, "activation": "linear", "output_dim": 50}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "elu", "name": "activation_9"}, "class_name": "Activation"}, {"config": {"W_constraint": null, "input_dim": 50, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "name": "dense_3", "bias": true, "W_regularizer": null, "trainable": true, "b_constraint": null, "activation": "linear", "output_dim": 10}, "class_name": "Dense"}, {"config": {"W_constraint": null, "input_dim": 10, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "name": "dense_4", "bias": true, "W_regularizer": null, "trainable": true, "b_constraint": null, "activation": "linear", "output_dim": 1}, "class_name": "Dense"}], "keras_version": "1.2.0", "class_name": "Sequential"}